# Data Structure - 3
-  pandas

## Pandas
-  http://cs231n.github.io/python-numpy-tutorial/
-  pandas - dataframe, excel like 
-  https://mode.com/python-tutorial/pandas-dataframe/ 
-  https://pandas.pydata.org/pandas-docs/stable/
-

In [4]:
import pandas as pd
import numpy as np
import os
#https://pandas.pydata.org/
print(pd.__version__)

2.1.0

In [5]:
#from list
my_list = [1,2,3,4,5,10]
df = pd.DataFrame(my_list , columns = ['columnName'])
df

   columnName
0           1
1           2
2           3
3           4
4           5
5          10

In [3]:
# from dictionary
my_dict = { 'A':[1,2,3,5, 9], 'B': [10, 20, 5, 39, 7]}
df = pd.DataFrame(my_dict)
df

   A   B
0  1  10
1  2  20
2  3   5
3  5  39
4  9   7

In [4]:
df.loc[0]  #row label

A     1
B    10
Name: 0, dtype: int64

In [5]:
df.iloc[0] # row index

A     1
B    10
Name: 0, dtype: int64

In [6]:
df.iat[0,0]  #single value interesction of row and col; col & row by index

1

In [7]:
df.at[0,'A']  #column by name

1

In [8]:
df.rename(columns = {'A':'newA'})

   newA   B
0     1  10
1     2  20
2     3   5
3     5  39
4     9   7

In [9]:
df['A'].apply(lambda x : x*2)

0     2
1     4
2     6
3    10
4    18
Name: A, dtype: int64

In [10]:
df.replace(1, 10)

    A   B
0  10  10
1   2  20
2   3   5
3   5  39
4   9   7

In [11]:
df.agg({'A':['min', 'max', 'mean', 'sum']})

         A
min    1.0
max    9.0
mean   4.0
sum   20.0

In [12]:
df1 = pd.DataFrame({'rollno':[1,2,3], 'marks1':[4,5,6]})
df2 = pd.DataFrame({'rollno':[1,2,3], 'marks2':[7,8,9]})
print(df1)
df = pd.merge(df1, df2, on='rollno') #
#merge is more versatile, it requires specifying the columns as a merge key. 
print(df)

   rollno  marks1
0       1       4
1       2       5
2       3       6
   rollno  marks1  marks2
0       1       4       7
1       2       5       8
2       3       6       9

In [13]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'C':[7,8,9]})
print (df1,'\n', df2)
df = df1.join(df2)  #using index key
df

   A  B
0  1  4
1  2  5
2  3  6
    C
0  7
1  8
2  9

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
df['date'] = pd.to_datetime('2023-10-02')
df

   A  B  C       date
0  1  4  7 2023-10-02
1  2  5  8 2023-10-02
2  3  6  9 2023-10-02

In [15]:
import datetime as dt

In [16]:
print(df['date'].dt.year)
print(df['date'].dt.month)
print(df['date'].dt.day)

0    2023
1    2023
2    2023
Name: date, dtype: int32
0    10
1    10
2    10
Name: date, dtype: int32
0    2
1    2
2    2
Name: date, dtype: int32

In [20]:
df.to_csv('filedf.csv', index=False)

In [21]:
os.listdir()

['.ipynb_checkpoints',
 'A01_trgSch.ipynb',
 'A03_cheatsheets.ipynb',
 'A05_learningResources.ipynb',
 'A08_jupyterHelp.ipynb',
 'A31_libraries.ipynb',
 'A35_pandasIndex.ipynb',
 'A41_commands.ipynb',
 'A45_help.ipynb',
 'A51_dsBasic.ipynb',
 'A52_dsNP.ipynb',
 'A53_dsPD.ipynb',
 'A56_condStatements.ipynb',
 'B23_outliersNA.ipynb',
 'B24_encoding.ipynb',
 'B25_findreplace.ipynb',
 'B31_plotMultipleCols.ipynb',
 'B32_stats1.ipynb',
 'B45_dates.ipynb',
 'B61_mtcars1.ipynb',
 'B62_mtpynb.ipynb',
 'B71_EDA1.ipynb',
 'B72_EDA2.ipynb',
 'C21_graphs1.ipynb',
 'C25_mplInteractive.ipynb',
 'C25_snsPlots.ipynb',
 'C42_altairGraphs.ipynb',
 'C51_wordCloud1.ipynb',
 'C52_wordCloud2.ipynb',
 'C61_dfTopdf.ipynb',
 'C64_graphsTopdf.ipynb',
 'C71_widgetsInteract.ipynb',
 'D11_modeling.ipynb',
 'D12_modelingSubTasks.ipynb',
 'D15_allModels1.ipynb',
 'D21_LinearRegression1.ipynb',
 'D23_LinearRegression2.ipynb',
 'D23_LogRegression1.ipynb',
 'D31_Clustering.ipynb',
 'D41_DecisionTree.ipynb',
 'D91_autoML.ipynb',
 'D92_pyCaret.ipynb',
 'E11_caseBlank.ipynb',
 'E21_CaseStudy1.ipynb',
 'E22_caseStudy2B.ipynb',
 'E25_HRAttritution.ipynb',
 'E55_sentimentAnalysis.ipynb',
 'E57_ResumeScreening.ipynb',
 'figure.png',
 'filedf.csv',
 'logs.log',
 'nlp_BERT.ipynb',
 'resume_parser.ipynb']

In [22]:
## larger DF

In [23]:
df1 = pd.DataFrame({'rollno':[1,2,3,4,5], 
                    'name': [ "Dhiraj", "Kounal", "Akhil", "Pooja","Disha" ], 
                    'marks':[ 40, 50, 60.5, 70, 93 ], 
                    'gender':['M', 'M','M', 'F', 'F']})
print(df1)  # dict format
type(df1)

   rollno    name  marks gender
0       1  Dhiraj   40.0      M
1       2  Kounal   50.0      M
2       3   Akhil   60.5      M
3       4   Pooja   70.0      F
4       5   Disha   93.0      F

pandas.core.frame.DataFrame

In [24]:
print('Column Names - ', df1.columns)  #column names
print('Index/ Row Names - ', df1.index)  #row ids/ names  - here auto created
print('Data Types -\n', df1.dtypes) #data types
print('Shape of DF(R-C) -', df1.shape)  # rows and columns

Column Names -  Index(['rollno', 'name', 'marks', 'gender'], dtype='object')
Index/ Row Names -  RangeIndex(start=0, stop=5, step=1)
Data Types -
 rollno      int64
name       object
marks     float64
gender     object
dtype: object
Shape of DF(R-C) - (5, 4)

In [25]:
print('Describe Values (Numerical)-\t  ')
df1.describe() #description of numerical values

Describe Values (Numerical)-

         rollno      marks
count  5.000000   5.000000
mean   3.000000  62.700000
std    1.581139  20.327322
min    1.000000  40.000000
25%    2.000000  50.000000
50%    3.000000  60.500000
75%    4.000000  70.000000
max    5.000000  93.000000

In [26]:
# Groupby Functions on DF
df1.groupby('gender').size()  # how many M, F

gender
F    2
M    3
dtype: int64

## using Built In Data Sets
-  install pydatasets : !pip install pydataset

In [28]:
from pydataset import data
mtcars = data('mtcars')
mtcars.shape

(32, 11)

In [29]:
mtcars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [30]:
mtcars.describe(include='all')

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [31]:
mtcars.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear',
       'carb'],
      dtype='object')

In [48]:
# settings of pandas
# https://pandas.pydata.org/docs/user_guide/options.html
pd.set_option('display.max_columns', None)
pd.set_option('max_colwidth', None)
pd.set_option("expand_frame_repr", True)
pd.set_option("max_info_columns", 11)
pd.set_option("display.precision", 3)
pd.set_option('display.width', 1000)  #wrap with full display

In [1]:
np.set_printoptions(edgeitems=30, linewidth=100000,   formatter=dict(float=lambda x: "%.3g" % x))

NameError: name 'np' is not defined

In [2]:
mtcars.columns

NameError: name 'mtcars' is not defined

In [50]:
mtcars.mean()

mpg      20.091
cyl       6.188
disp    230.722
hp      146.688
drat      3.597
wt        3.217
qsec     17.849
vs        0.438
am        0.406
gear      3.688
carb      2.812
dtype: float64

## Export Data to CSV/ Excel
-  write to csv 
    -  https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html
-  write to excel
-   -  https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html
-  write to other formats

In [55]:
mtcars.to_csv( 'mtcars.csv')
', '.join(os.listdir())

'.ipynb_checkpoints, A01_trgSch.ipynb, A03_cheatsheets.ipynb, A05_learningResources.ipynb, A08_jupyterHelp.ipynb, A31_libraries.ipynb, A35_pandasIndex.ipynb, A41_commands.ipynb, A45_help.ipynb, A51_dsBasic.ipynb, A52_dsNP.ipynb, A53_dsPD.ipynb, A56_condStatements.ipynb, B23_outliersNA.ipynb, B24_encoding.ipynb, B25_findreplace.ipynb, B31_plotMultipleCols.ipynb, B32_stats1.ipynb, B45_dates.ipynb, B61_mtcars1.ipynb, B62_mtpynb.ipynb, B71_EDA1.ipynb, B72_EDA2.ipynb, C21_graphs1.ipynb, C25_mplInteractive.ipynb, C25_snsPlots.ipynb, C42_altairGraphs.ipynb, C51_wordCloud1.ipynb, C52_wordCloud2.ipynb, C61_dfTopdf.ipynb, C64_graphsTopdf.ipynb, C71_widgetsInteract.ipynb, D11_modeling.ipynb, D12_modelingSubTasks.ipynb, D15_allModels1.ipynb, D21_LinearRegression1.ipynb, D23_LinearRegression2.ipynb, D23_LogRegression1.ipynb, D31_Clustering.ipynb, D41_DecisionTree.ipynb, D91_autoML.ipynb, D92_pyCaret.ipynb, E11_caseBlank.ipynb, E21_CaseStudy1.ipynb, E22_caseStudy2B.ipynb, E25_HRAttritution.ipynb, E55_sentimentAnalysis.ipynb, E57_ResumeScreening.ipynb, figure.png, filedf.csv, logs.log, mtcars.csv, nlp_BERT.ipynb, resume_parser.ipynb'

In [60]:
import glob  #search file with pattern
glob.glob("*.csv")

['filedf.csv', 'mtcars.csv']

In [61]:
mtcars.to_excel('mtcars.xlsx')

In [62]:
glob.glob("*.xlsx")

['mtcars.xlsx']

## Import Data to CSV/ Excel/ Web CSV
-  from csv
-  from excel
    -  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html

In [63]:
df1 = pd.read_csv('mtcars.csv')
df1.head()

          Unnamed: 0   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2         Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [65]:
df1B = df1.drop("Unnamed: 0", axis=1)
df1B.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

### remove unnamed column or at the time of saving to csv, don't save index column
-  mtcars.to_csv('mtcars.csv', index=False)
-  mtcars.to_excel('mtcars.xlsx', index=False)

In [66]:
df2 = pd.read_excel('mtcars.xlsx', sheet_name=0)
df2.head()

          Unnamed: 0   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2         Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [67]:
# Not try import your own data in excel or csv into python and do summary

## Links
-  https://pandas.pydata.org/docs/user_guide/index.html
-  https://pandas.pydata.org/docs/reference/index.html

### Next
-  do summary actions on dataframe structure